occhiman/S32K3X8-QEMU/qemu/hw/net/can/s32k3x8_flexcan.c
/*
 * NXP S32K3X8 FlexCAN model (minimal MCAL-oriented implementation).
 *
 * This model focuses on the register and mailbox behavior needed for
 * AUTOSAR MCAL FlexCAN bring-up on S32K3X8 QEMU.
 */

#include "qemu/osdep.h"
#include "qapi/error.h"
#include "qemu/log.h"
#include "qemu/module.h"
#include "hw/irq.h"
#include "hw/qdev-properties.h"
#include "hw/net/s32k3x8_flexcan.h"

/* Core register offsets (S32K3xx FlexCAN layout). */
#define FLEXCAN_MCR_OFFSET             0x000
#define FLEXCAN_CTRL1_OFFSET           0x004
#define FLEXCAN_TIMER_OFFSET           0x008
#define FLEXCAN_RXMGMASK_OFFSET        0x010
#define FLEXCAN_RX14MASK_OFFSET        0x014
#define FLEXCAN_RX15MASK_OFFSET        0x018
#define FLEXCAN_ECR_OFFSET             0x01c
#define FLEXCAN_ESR1_OFFSET            0x020
#define FLEXCAN_IMASK2_OFFSET          0x024
#define FLEXCAN_IMASK1_OFFSET          0x028
#define FLEXCAN_IFLAG2_OFFSET          0x02c
#define FLEXCAN_IFLAG1_OFFSET          0x030
#define FLEXCAN_CTRL2_OFFSET           0x034
#define FLEXCAN_ESR2_OFFSET            0x038
#define FLEXCAN_RXFGMASK_OFFSET        0x048
#define FLEXCAN_RXFIR_OFFSET           0x04c
#define FLEXCAN_IMASK3_OFFSET          0x06c
#define FLEXCAN_IFLAG3_OFFSET          0x074
#define FLEXCAN_RXIMR_OFFSET           0x880
#define FLEXCAN_FDCTRL_OFFSET          0xc00
#define FLEXCAN_ERFCR_OFFSET           0xc0c
#define FLEXCAN_ERFIER_OFFSET          0xc10
#define FLEXCAN_ERFSR_OFFSET           0xc14
#define FLEXCAN_ERFFEL_OFFSET          0x3000

/*
 * Message buffer RAM layout:
 * - 3 RAM blocks of 512 bytes each starting at FLEXCAN_MB_OFFSET.
 * - MB payload size per block is selected by FDCTRL.MBDSR{0,1,2}.
 * - Each MB uses 8 bytes arbitration/control + payload bytes.
 */
#define FLEXCAN_MB_OFFSET              0x080
#define FLEXCAN_MB_WORDS               4
#define FLEXCAN_MB_COUNT               32
#define FLEXCAN_MB_RAMBLOCK_BYTES      512U
#define FLEXCAN_MB_ARBITRATION_BYTES   8U
#define FLEXCAN_MBDSR_BLOCK_COUNT      3U
#define FLEXCAN_LEGACY_FILTER_OFFSET   0x0e0
#define FLEXCAN_ENHANCED_FIFO_OFFSET   0x2000

/* MCR bits used by MCAL startup/stop sequence. */
#define FLEXCAN_MCR_MAXMB_MASK         0x0000007fU
#define FLEXCAN_MCR_IDAM_MASK          0x00000300U
#define FLEXCAN_MCR_IDAM_SHIFT         8
#define FLEXCAN_MCR_IRMQ_MASK          0x00010000U
#define FLEXCAN_MCR_SRXDIS_MASK        0x00020000U
#define FLEXCAN_MCR_LPMACK_MASK        0x00100000U
#define FLEXCAN_MCR_FRZACK_MASK        0x01000000U
#define FLEXCAN_MCR_SOFTRST_MASK       0x02000000U
#define FLEXCAN_MCR_NOTRDY_MASK        0x08000000U
#define FLEXCAN_MCR_HALT_MASK          0x10000000U
#define FLEXCAN_MCR_RFEN_MASK          0x20000000U
#define FLEXCAN_MCR_FRZ_MASK           0x40000000U
#define FLEXCAN_MCR_MDIS_MASK          0x80000000U
#define FLEXCAN_CTRL1_LPB_MASK         0x00001000U
#define FLEXCAN_CTRL2_RFFN_MASK        0x0f000000U
#define FLEXCAN_CTRL2_RFFN_SHIFT       24

/* MB CS field bits. */
#define FLEXCAN_CS_TIMESTAMP_MASK      0x0000ffffU
#define FLEXCAN_CS_DLC_MASK            0x000f0000U
#define FLEXCAN_CS_DLC_SHIFT           16
#define FLEXCAN_CS_RTR_MASK            0x00100000U
#define FLEXCAN_CS_IDE_MASK            0x00200000U
#define FLEXCAN_CS_CODE_MASK           0x0f000000U
#define FLEXCAN_CS_CODE_SHIFT          24
#define FLEXCAN_CS_ESI_MASK            0x20000000U
#define FLEXCAN_CS_BRS_MASK            0x40000000U
#define FLEXCAN_CS_EDL_MASK            0x80000000U

#define FLEXCAN_FDCTRL_MBDSR0_MASK     0x00030000U
#define FLEXCAN_FDCTRL_MBDSR0_SHIFT    16U
#define FLEXCAN_FDCTRL_MBDSR1_MASK     0x00180000U
#define FLEXCAN_FDCTRL_MBDSR1_SHIFT    19U
#define FLEXCAN_FDCTRL_MBDSR2_MASK     0x00c00000U
#define FLEXCAN_FDCTRL_MBDSR2_SHIFT    22U

#define FLEXCAN_STD_ID_SHIFT           18

/*
 * RX FIFO format A table encodes RTR/IDE in bits 31/30 (not MB CS layout).
 * See FlexCAN_Ip_HwAccess.c: FlexCAN_SetRxFifoFilterFormatA().
 */
#define FLEXCAN_FIFO_FILTER_RTR_MASK   (1U << 31)
#define FLEXCAN_FIFO_FILTER_IDE_MASK   (1U << 30)

/* MB code values used by MCAL. */
#define FLEXCAN_RX_FULL                0x2U
#define FLEXCAN_RX_EMPTY               0x4U
#define FLEXCAN_TX_INACTIVE            0x8U
#define FLEXCAN_TX_ABORT               0x9U
#define FLEXCAN_TX_DATA_CODE           0xcU

#define FLEXCAN_IFLAG1_BUF5I_MASK      0x00000020U
#define FLEXCAN_IFLAG1_BUF6I_MASK      0x00000040U
#define FLEXCAN_IFLAG1_BUF7I_MASK      0x00000080U
#define FLEXCAN_IFLAG1_FIFO_MASK       (FLEXCAN_IFLAG1_BUF5I_MASK | \
                                        FLEXCAN_IFLAG1_BUF6I_MASK | \
                                        FLEXCAN_IFLAG1_BUF7I_MASK)

#define FLEXCAN_ERFCR_ERFWM_MASK       0x0000001fU
#define FLEXCAN_ERFCR_NFE_MASK         0x00003f00U
#define FLEXCAN_ERFCR_NFE_SHIFT        8
#define FLEXCAN_ERFCR_NEXIF_MASK       0x007f0000U
#define FLEXCAN_ERFCR_NEXIF_SHIFT      16
#define FLEXCAN_ERFCR_ERFEN_MASK       0x80000000U

#define FLEXCAN_ERFSR_ERFEL_MASK       0x0000003fU
#define FLEXCAN_ERFSR_ERFF_MASK        0x00010000U
#define FLEXCAN_ERFSR_ERFE_MASK        0x00020000U
#define FLEXCAN_ERFSR_ERFCLR_MASK      0x08000000U
#define FLEXCAN_ERFSR_ERFDA_MASK       0x10000000U
#define FLEXCAN_ERFSR_ERFWMI_MASK      0x20000000U
#define FLEXCAN_ERFSR_ERFOVF_MASK      0x40000000U
#define FLEXCAN_ERFSR_ERFUFW_MASK      0x80000000U
#define FLEXCAN_ERFSR_INT_MASK         (FLEXCAN_ERFSR_ERFDA_MASK | \
                                        FLEXCAN_ERFSR_ERFWMI_MASK | \
                                        FLEXCAN_ERFSR_ERFOVF_MASK | \
                                        FLEXCAN_ERFSR_ERFUFW_MASK)

#define FLEXCAN_LEGACY_IDHIT_MASK      0x000001ffU

/* ESR1 is mostly W1C from software perspective. */
#define FLEXCAN_ESR1_W1C_MASK          0xffffffffU

static ssize_t s32k3x8_flexcan_receive(CanBusClientState *client,
                                       const qemu_can_frame *frames,
                                       size_t frames_cnt);

static inline uint32_t flexcan_reg_index(hwaddr addr)
{
    return (uint32_t)(addr >> 2);
}

static inline uint8_t s32k3x8_flexcan_block_payload_size(
    const S32K3X8FlexCANState *s,
    unsigned block_idx)
{
    uint32_t fdctrl = s->regs[flexcan_reg_index(FLEXCAN_FDCTRL_OFFSET)];
    uint32_t mbdsr = 0U;

