occhiman/S32K3X8-QEMU/qemu/hw/net/can/s32k3x8_flexcan.c
    switch (block_idx) {
    case 0:
        mbdsr = (fdctrl & FLEXCAN_FDCTRL_MBDSR0_MASK) >>
                FLEXCAN_FDCTRL_MBDSR0_SHIFT;
        break;
    case 1:
        mbdsr = (fdctrl & FLEXCAN_FDCTRL_MBDSR1_MASK) >>
                FLEXCAN_FDCTRL_MBDSR1_SHIFT;
        break;
    case 2:
        mbdsr = (fdctrl & FLEXCAN_FDCTRL_MBDSR2_MASK) >>
                FLEXCAN_FDCTRL_MBDSR2_SHIFT;
        break;
    default:
        break;
    }

    if (mbdsr > 3U) {
        mbdsr = 0U;
    }

    return (uint8_t)(8U << mbdsr);
}

static bool s32k3x8_flexcan_mb_offset(const S32K3X8FlexCANState *s,
                                      unsigned mb_idx,
                                      uint32_t *offset)
{
    unsigned msg_idx = mb_idx;
    uint32_t block_offset = 0U;

    if (mb_idx >= FLEXCAN_MB_COUNT) {
        return false;
    }

    for (unsigned block = 0; block < FLEXCAN_MBDSR_BLOCK_COUNT; block++) {
        uint8_t payload_size = s32k3x8_flexcan_block_payload_size(s, block);
        uint8_t mb_size = payload_size + FLEXCAN_MB_ARBITRATION_BYTES;
        uint8_t max_mb = (uint8_t)(FLEXCAN_MB_RAMBLOCK_BYTES / mb_size);

        if (max_mb == 0U) {
            return false;
        }

        if (msg_idx < max_mb) {
            *offset = FLEXCAN_MB_OFFSET + block_offset +
                      ((uint32_t)msg_idx * (uint32_t)mb_size);
            return true;
        }

        msg_idx -= max_mb;
        block_offset += FLEXCAN_MB_RAMBLOCK_BYTES;
    }

    return false;
}

static inline uint8_t s32k3x8_flexcan_mb_payload_size(
    const S32K3X8FlexCANState *s,
    unsigned mb_idx)
{
    unsigned msg_idx = mb_idx;

    for (unsigned block = 0; block < FLEXCAN_MBDSR_BLOCK_COUNT; block++) {
        uint8_t payload_size = s32k3x8_flexcan_block_payload_size(s, block);
        uint8_t mb_size = payload_size + FLEXCAN_MB_ARBITRATION_BYTES;
        uint8_t max_mb = (uint8_t)(FLEXCAN_MB_RAMBLOCK_BYTES / mb_size);

        if (max_mb == 0U) {
            return 8U;
        }

        if (msg_idx < max_mb) {
            return payload_size;
        }

        msg_idx -= max_mb;
    }

    return 8U;
}

static inline uint32_t *flexcan_mb_addr(S32K3X8FlexCANState *s, unsigned mb_idx)
{
    uint32_t offset;

    if (!s32k3x8_flexcan_mb_offset(s, mb_idx, &offset)) {
        return NULL;
    }

    return &s->regs[flexcan_reg_index(offset)];
}

static inline const uint32_t *flexcan_mb_addr_const(
    const S32K3X8FlexCANState *s,
    unsigned mb_idx)
{
    uint32_t offset;

    if (!s32k3x8_flexcan_mb_offset(s, mb_idx, &offset)) {
        return NULL;
    }

    return &s->regs[flexcan_reg_index(offset)];
}

static inline uint32_t flexcan_raw_read_le(const S32K3X8FlexCANState *s,
                                           hwaddr addr,
                                           unsigned size)
{
    const uint8_t *raw = (const uint8_t *)s->regs;
    uint32_t value = 0U;

    for (unsigned i = 0; i < size; i++) {
        value |= ((uint32_t)raw[addr + i]) << (8U * i);
    }

    return value;
}

static inline void flexcan_raw_write_le(S32K3X8FlexCANState *s,
                                        hwaddr addr,
                                        uint32_t value,
                                        unsigned size)
{
    uint8_t *raw = (uint8_t *)s->regs;

    for (unsigned i = 0; i < size; i++) {
        raw[addr + i] = (uint8_t)(value >> (8U * i));
    }
}

static inline bool flexcan_is_mb_cs_addr(const S32K3X8FlexCANState *s,
                                         hwaddr addr,
                                         unsigned *mb_idx)
{
    uint32_t mb_off;

    if ((addr & 0x3U) != 0U) {
        return false;
    }

    for (unsigned idx = 0; idx < FLEXCAN_MB_COUNT; idx++) {
        if (!s32k3x8_flexcan_mb_offset(s, idx, &mb_off)) {
            break;
        }
        if (addr == mb_off) {
            *mb_idx = idx;
            return true;
        }
    }

    return false;
}

static inline uint32_t flexcan_cs_code(uint32_t cs)
{
    return (cs & FLEXCAN_CS_CODE_MASK) >> FLEXCAN_CS_CODE_SHIFT;
}

static inline uint8_t flexcan_word_swapped_index(uint8_t index)
{
    return (index & (uint8_t)~3U) + (3U - (index & 3U));
}

static inline bool s32k3x8_flexcan_legacy_fifo_enabled(
    const S32K3X8FlexCANState *s)
{
    return (s->regs[flexcan_reg_index(FLEXCAN_MCR_OFFSET)] &
            FLEXCAN_MCR_RFEN_MASK) != 0U;
}

static inline bool s32k3x8_flexcan_enhanced_fifo_enabled(
    const S32K3X8FlexCANState *s)
{
    return (s->regs[flexcan_reg_index(FLEXCAN_ERFCR_OFFSET)] &
            FLEXCAN_ERFCR_ERFEN_MASK) != 0U;
}

static inline uint32_t s32k3x8_flexcan_legacy_filter_count(
    const S32K3X8FlexCANState *s)
{
    uint32_t rffn = (s->regs[flexcan_reg_index(FLEXCAN_CTRL2_OFFSET)] &
                     FLEXCAN_CTRL2_RFFN_MASK) >> FLEXCAN_CTRL2_RFFN_SHIFT;

    return (rffn + 1U) * 8U;
}

static inline uint32_t s32k3x8_flexcan_legacy_filter_mask(
    const S32K3X8FlexCANState *s,
    uint32_t filter_idx)
{
    uint32_t mcr = s->regs[flexcan_reg_index(FLEXCAN_MCR_OFFSET)];

    if ((mcr & FLEXCAN_MCR_IRMQ_MASK) && (filter_idx < 96U)) {
        return s->regs[flexcan_reg_index(FLEXCAN_RXIMR_OFFSET) + filter_idx];
    }

    return s->regs[flexcan_reg_index(FLEXCAN_RXFGMASK_OFFSET)];
}

static void s32k3x8_flexcan_encode_rx_words(S32K3X8FlexCANState *s,
                                            uint32_t *target,
                                            const qemu_can_frame *frame,
                                            uint8_t payload_capacity)
{
    uint32_t frame_id = frame->can_id;
    bool eff = (frame_id & QEMU_CAN_EFF_FLAG) != 0U;
    bool rtr = (frame_id & QEMU_CAN_RTR_FLAG) != 0U;
    uint8_t len = frame->can_dlc;
    bool is_fd = (frame->flags & QEMU_CAN_FRMF_TYPE_FD) != 0U;
    uint8_t *target_bytes = (uint8_t *)&target[2];
    uint8_t copy_len;
    uint32_t cs = 0;

    if (len > 64U) {
        len = 64U;
    }
    if (!is_fd && (len > 8U)) {
        is_fd = true;
    }
    copy_len = MIN(len, payload_capacity);

    memset(&target[2], 0, payload_capacity);
    for (uint8_t i = 0; i < copy_len; i++) {
        target_bytes[flexcan_word_swapped_index(i)] = frame->data[i];
    }

    if (eff) {
        target[1] = frame_id & QEMU_CAN_EFF_MASK;
        cs |= FLEXCAN_CS_IDE_MASK;
    } else {
        target[1] = (frame_id & QEMU_CAN_SFF_MASK) << FLEXCAN_STD_ID_SHIFT;
    }

