occhiman/S32K3X8-QEMU/qemu/hw/net/can/s32k3x8_flexcan.c
    if (rtr) {
        cs |= FLEXCAN_CS_RTR_MASK;
    }
    if (is_fd) {
        cs |= FLEXCAN_CS_EDL_MASK;
        if (frame->flags & QEMU_CAN_FRMF_BRS) {
            cs |= FLEXCAN_CS_BRS_MASK;
        }
        if (frame->flags & QEMU_CAN_FRMF_ESI) {
            cs |= FLEXCAN_CS_ESI_MASK;
        }
    }

    cs |= ((uint32_t)can_len2dlc(len) << FLEXCAN_CS_DLC_SHIFT) &
          FLEXCAN_CS_DLC_MASK;
    cs |= ((uint32_t)FLEXCAN_RX_FULL << FLEXCAN_CS_CODE_SHIFT) &
          FLEXCAN_CS_CODE_MASK;
    cs |= (uint32_t)s->timestamp++ & FLEXCAN_CS_TIMESTAMP_MASK;
    target[0] = cs;
}

static void s32k3x8_flexcan_reset_legacy_fifo(S32K3X8FlexCANState *s)
{
    s->legacy_fifo_head = 0;
    s->legacy_fifo_tail = 0;
    s->legacy_fifo_count = 0;
    s->regs[flexcan_reg_index(FLEXCAN_RXFIR_OFFSET)] = 0;
    s->regs[flexcan_reg_index(FLEXCAN_IFLAG1_OFFSET)] &= ~FLEXCAN_IFLAG1_FIFO_MASK;
}

static void s32k3x8_flexcan_legacy_update_status(S32K3X8FlexCANState *s)
{
    uint32_t iflag1 = s->regs[flexcan_reg_index(FLEXCAN_IFLAG1_OFFSET)];

    iflag1 &= ~FLEXCAN_IFLAG1_BUF6I_MASK;
    if (s->legacy_fifo_count >= (S32K3X8_FLEXCAN_LEGACY_FIFO_CAPACITY - 1U) &&
        s->legacy_fifo_count > 0U) {
        iflag1 |= FLEXCAN_IFLAG1_BUF6I_MASK;
    }

    s->regs[flexcan_reg_index(FLEXCAN_IFLAG1_OFFSET)] = iflag1;
}

static inline void s32k3x8_flexcan_legacy_dma_irq_fallback(S32K3X8FlexCANState *s)
{
    uint32_t imask1 = s->regs[flexcan_reg_index(FLEXCAN_IMASK1_OFFSET)];

    if ((imask1 & FLEXCAN_IFLAG1_BUF5I_MASK) == 0U) {
        /*
         * MCAL DMA-based legacy FIFO reception expects eDMA requests that are
         * not modeled yet. Unmask BUF5I so FIFO frames can complete through
         * the regular ISR callback path.
         */
        s->regs[flexcan_reg_index(FLEXCAN_IMASK1_OFFSET)] =
            imask1 | FLEXCAN_IFLAG1_BUF5I_MASK;
    }
}

static void s32k3x8_flexcan_legacy_present_front(S32K3X8FlexCANState *s)
{
    uint32_t iflag1 = s->regs[flexcan_reg_index(FLEXCAN_IFLAG1_OFFSET)];

    if (s->legacy_fifo_count == 0U) {
        s->regs[flexcan_reg_index(FLEXCAN_IFLAG1_OFFSET)] =
            iflag1 & ~FLEXCAN_IFLAG1_BUF5I_MASK;
        s->regs[flexcan_reg_index(FLEXCAN_RXFIR_OFFSET)] = 0;
        return;
    }

    if (iflag1 & FLEXCAN_IFLAG1_BUF5I_MASK) {
        return;
    }

    s32k3x8_flexcan_encode_rx_words(
        s,
        flexcan_mb_addr(s, 0),
        &s->legacy_fifo[s->legacy_fifo_head].frame,
        s32k3x8_flexcan_mb_payload_size(s, 0));
    s->regs[flexcan_reg_index(FLEXCAN_RXFIR_OFFSET)] =
        s->legacy_fifo[s->legacy_fifo_head].idhit & FLEXCAN_LEGACY_IDHIT_MASK;
    s32k3x8_flexcan_legacy_dma_irq_fallback(s);
    s->regs[flexcan_reg_index(FLEXCAN_IFLAG1_OFFSET)] |=
        FLEXCAN_IFLAG1_BUF5I_MASK;
}

static void s32k3x8_flexcan_legacy_pop(S32K3X8FlexCANState *s)
{
    if (s->legacy_fifo_count == 0U) {
        return;
    }

    s->legacy_fifo_head =
        (s->legacy_fifo_head + 1U) % S32K3X8_FLEXCAN_LEGACY_FIFO_CAPACITY;
    s->legacy_fifo_count--;

    s->regs[flexcan_reg_index(FLEXCAN_IFLAG1_OFFSET)] &= ~FLEXCAN_IFLAG1_BUF5I_MASK;
    s32k3x8_flexcan_legacy_present_front(s);
    s32k3x8_flexcan_legacy_update_status(s);
}

static bool s32k3x8_flexcan_legacy_filter_accept(
    const S32K3X8FlexCANState *s,
    const qemu_can_frame *frame,
    uint16_t *idhit)
{
    uint32_t mcr = s->regs[flexcan_reg_index(FLEXCAN_MCR_OFFSET)];
    uint32_t idam = (mcr & FLEXCAN_MCR_IDAM_MASK) >> FLEXCAN_MCR_IDAM_SHIFT;

    if (idam != 0U) {
        /* IDAM B/C not modeled yet: accept frame and report default hit. */
        *idhit = 0;
        return true;
    }

    uint32_t filter_count = s32k3x8_flexcan_legacy_filter_count(s);
    bool frame_eff = (frame->can_id & QEMU_CAN_EFF_FLAG) != 0U;
    bool frame_rtr = (frame->can_id & QEMU_CAN_RTR_FLAG) != 0U;
    uint32_t frame_cmp;

    if (frame_eff) {
        frame_cmp = FLEXCAN_FIFO_FILTER_IDE_MASK |
                    (frame_rtr ? FLEXCAN_FIFO_FILTER_RTR_MASK : 0U) |
                    ((frame->can_id & QEMU_CAN_EFF_MASK) << 1);
    } else {
        frame_cmp = (frame_rtr ? FLEXCAN_FIFO_FILTER_RTR_MASK : 0U) |
                    ((frame->can_id & QEMU_CAN_SFF_MASK) << 19);
    }

    for (uint32_t i = 0; i < filter_count; i++) {
        uint32_t entry =
            s->regs[flexcan_reg_index(FLEXCAN_LEGACY_FILTER_OFFSET + (i * 4U))];
        uint32_t mask = s32k3x8_flexcan_legacy_filter_mask(s, i);
        if ((entry & mask) == (frame_cmp & mask)) {
            *idhit = (uint16_t)i;
            return true;
        }
    }

    return false;
}

static bool s32k3x8_flexcan_legacy_enqueue(S32K3X8FlexCANState *s,
                                           const qemu_can_frame *frame)
{
    uint16_t idhit;

    if (!s32k3x8_flexcan_legacy_filter_accept(s, frame, &idhit)) {
        return false;
    }
    if (s->legacy_fifo_count >= S32K3X8_FLEXCAN_LEGACY_FIFO_CAPACITY) {
        s->regs[flexcan_reg_index(FLEXCAN_IFLAG1_OFFSET)] |= FLEXCAN_IFLAG1_BUF7I_MASK;
        return false;
    }

    s->legacy_fifo[s->legacy_fifo_tail].frame = *frame;
    s->legacy_fifo[s->legacy_fifo_tail].idhit = idhit;
    s->legacy_fifo_tail =
        (s->legacy_fifo_tail + 1U) % S32K3X8_FLEXCAN_LEGACY_FIFO_CAPACITY;
    s->legacy_fifo_count++;

    s32k3x8_flexcan_legacy_present_front(s);
    s32k3x8_flexcan_legacy_update_status(s);
    return true;
}

static void s32k3x8_flexcan_enhanced_clear_output(S32K3X8FlexCANState *s)
{
    uint32_t out_idx = flexcan_reg_index(FLEXCAN_ENHANCED_FIFO_OFFSET);

    memset(&s->regs[out_idx], 0, 20 * sizeof(uint32_t));
}

static void s32k3x8_flexcan_enhanced_present_front(S32K3X8FlexCANState *s)
{
    uint32_t out_idx = flexcan_reg_index(FLEXCAN_ENHANCED_FIFO_OFFSET);
    uint32_t *out = &s->regs[out_idx];

    s32k3x8_flexcan_enhanced_clear_output(s);
    if (s->enhanced_fifo_count == 0U) {
        return;
    }

    s32k3x8_flexcan_encode_rx_words(
        s, out, &s->enhanced_fifo[s->enhanced_fifo_head].frame, 64U);
    {
        uint8_t len = s->enhanced_fifo[s->enhanced_fifo_head].frame.can_dlc;
        uint32_t idhit_offset = 2U + ((uint32_t)MIN(len, 64U) + 3U) / 4U;

        out[idhit_offset] = s->enhanced_fifo[s->enhanced_fifo_head].idhit & 0x7fU;
    }
}

static void s32k3x8_flexcan_enhanced_update_status(S32K3X8FlexCANState *s)
{
    uint32_t erfsr = s->regs[flexcan_reg_index(FLEXCAN_ERFSR_OFFSET)] &
                     (FLEXCAN_ERFSR_ERFOVF_MASK | FLEXCAN_ERFSR_ERFUFW_MASK);
    uint32_t watermark =
        s->regs[flexcan_reg_index(FLEXCAN_ERFCR_OFFSET)] & FLEXCAN_ERFCR_ERFWM_MASK;

