occhiman/S32K3X8-QEMU/qemu/hw/net/can/s32k3x8_flexcan.c
    erfsr |= s->enhanced_fifo_count & FLEXCAN_ERFSR_ERFEL_MASK;
    if (s->enhanced_fifo_count == 0U) {
        erfsr |= FLEXCAN_ERFSR_ERFE_MASK;
    } else {
        erfsr |= FLEXCAN_ERFSR_ERFDA_MASK;
        if (s->enhanced_fifo_count > watermark) {
            erfsr |= FLEXCAN_ERFSR_ERFWMI_MASK;
        }
    }
    if (s->enhanced_fifo_count >= S32K3X8_FLEXCAN_ENHANCED_FIFO_CAPACITY) {
        erfsr |= FLEXCAN_ERFSR_ERFF_MASK;
    }

    s->regs[flexcan_reg_index(FLEXCAN_ERFSR_OFFSET)] = erfsr;
}

static void s32k3x8_flexcan_reset_enhanced_fifo(S32K3X8FlexCANState *s)
{
    s->enhanced_fifo_head = 0;
    s->enhanced_fifo_tail = 0;
    s->enhanced_fifo_count = 0;
    s->regs[flexcan_reg_index(FLEXCAN_ERFSR_OFFSET)] = 0;
    s32k3x8_flexcan_enhanced_clear_output(s);
}

static void s32k3x8_flexcan_enhanced_pop(S32K3X8FlexCANState *s)
{
    if (s->enhanced_fifo_count == 0U) {
        s->regs[flexcan_reg_index(FLEXCAN_ERFSR_OFFSET)] |= FLEXCAN_ERFSR_ERFUFW_MASK;
    } else {
        s->enhanced_fifo_head =
            (s->enhanced_fifo_head + 1U) % S32K3X8_FLEXCAN_ENHANCED_FIFO_CAPACITY;
        s->enhanced_fifo_count--;
    }

    s32k3x8_flexcan_enhanced_present_front(s);
    s32k3x8_flexcan_enhanced_update_status(s);
}

static bool s32k3x8_flexcan_enhanced_enqueue(S32K3X8FlexCANState *s,
                                             const qemu_can_frame *frame)
{
    if (s->enhanced_fifo_count >= S32K3X8_FLEXCAN_ENHANCED_FIFO_CAPACITY) {
        s->regs[flexcan_reg_index(FLEXCAN_ERFSR_OFFSET)] |= FLEXCAN_ERFSR_ERFOVF_MASK;
        s32k3x8_flexcan_enhanced_update_status(s);
        return false;
    }

    s->enhanced_fifo[s->enhanced_fifo_tail].frame = *frame;
    s->enhanced_fifo[s->enhanced_fifo_tail].idhit = 0;
    s->enhanced_fifo_tail =
        (s->enhanced_fifo_tail + 1U) % S32K3X8_FLEXCAN_ENHANCED_FIFO_CAPACITY;
    s->enhanced_fifo_count++;

    s32k3x8_flexcan_enhanced_present_front(s);
    s32k3x8_flexcan_enhanced_update_status(s);
    return true;
}

static void s32k3x8_flexcan_update_irq(S32K3X8FlexCANState *s)
{
    if (s32k3x8_flexcan_legacy_fifo_enabled(s) && (s->legacy_fifo_count > 0U)) {
        s32k3x8_flexcan_legacy_dma_irq_fallback(s);
    }

    uint32_t pending_mb = s->regs[flexcan_reg_index(FLEXCAN_IFLAG1_OFFSET)] &
                          s->regs[flexcan_reg_index(FLEXCAN_IMASK1_OFFSET)];
    uint32_t pending_erf = s->regs[flexcan_reg_index(FLEXCAN_ERFSR_OFFSET)] &
                           s->regs[flexcan_reg_index(FLEXCAN_ERFIER_OFFSET)] &
                           FLEXCAN_ERFSR_INT_MASK;
    uint8_t level = (pending_mb | pending_erf) != 0U;

    qemu_set_irq(s->irq, level);
}

static void s32k3x8_flexcan_rearm_rx_mb_from_iflag1(S32K3X8FlexCANState *s,
                                                     uint32_t cleared_mask)
{
    for (unsigned mb_idx = 0; mb_idx < 32U; mb_idx++) {
        uint32_t bit = (uint32_t)1U << mb_idx;
        uint32_t *mb;
        uint32_t cs;

        if ((cleared_mask & bit) == 0U) {
            continue;
        }

        mb = flexcan_mb_addr(s, mb_idx);
        if (mb == NULL) {
            continue;
        }

        cs = mb[0];
        if (flexcan_cs_code(cs) == FLEXCAN_RX_FULL) {
            cs &= ~FLEXCAN_CS_CODE_MASK;
            cs |= (FLEXCAN_RX_EMPTY << FLEXCAN_CS_CODE_SHIFT) &
                  FLEXCAN_CS_CODE_MASK;
            mb[0] = cs;
        }
    }
}

static void s32k3x8_flexcan_update_mcr_state(S32K3X8FlexCANState *s)
{
    uint32_t mcr = s->regs[flexcan_reg_index(FLEXCAN_MCR_OFFSET)];
    bool mdis = (mcr & FLEXCAN_MCR_MDIS_MASK) != 0U;
    bool freeze_req;

    /*
     * In low-power disable mode, software expects the module to remain in a
     * frozen context so FlexCAN_Enable() can wait for FRZACK before exit.
     */
    if (mdis) {
        mcr |= FLEXCAN_MCR_FRZ_MASK | FLEXCAN_MCR_HALT_MASK;
    }

    freeze_req = (mcr & FLEXCAN_MCR_FRZ_MASK) &&
                 (mcr & FLEXCAN_MCR_HALT_MASK);

    mcr &= ~(FLEXCAN_MCR_LPMACK_MASK |
             FLEXCAN_MCR_FRZACK_MASK |
             FLEXCAN_MCR_NOTRDY_MASK |
             FLEXCAN_MCR_SOFTRST_MASK);

    if (mdis) {
        mcr |= FLEXCAN_MCR_LPMACK_MASK |
               FLEXCAN_MCR_FRZACK_MASK |
               FLEXCAN_MCR_NOTRDY_MASK;
    } else if (freeze_req) {
        mcr |= FLEXCAN_MCR_FRZACK_MASK |
               FLEXCAN_MCR_NOTRDY_MASK;
    }

    s->regs[flexcan_reg_index(FLEXCAN_MCR_OFFSET)] = mcr;
}

static void s32k3x8_flexcan_reset_registers(S32K3X8FlexCANState *s)
{
    memset(s->regs, 0, sizeof(s->regs));
    s->timestamp = 0;
    s32k3x8_flexcan_reset_legacy_fifo(s);
    s32k3x8_flexcan_reset_enhanced_fifo(s);

    /* Start disabled with 32 message buffers selected. */
    s->regs[flexcan_reg_index(FLEXCAN_MCR_OFFSET)] = FLEXCAN_MCR_MDIS_MASK |
                                                     31U;
    s->regs[flexcan_reg_index(FLEXCAN_RXMGMASK_OFFSET)] = 0xffffffffU;
    s->regs[flexcan_reg_index(FLEXCAN_RXFGMASK_OFFSET)] = 0xffffffffU;
    s->regs[flexcan_reg_index(FLEXCAN_RX14MASK_OFFSET)] = 0xffffffffU;
    s->regs[flexcan_reg_index(FLEXCAN_RX15MASK_OFFSET)] = 0xffffffffU;

    for (unsigned i = 0; i < 96; i++) {
        s->regs[flexcan_reg_index(FLEXCAN_RXIMR_OFFSET) + i] = 0xffffffffU;
    }

    s32k3x8_flexcan_update_mcr_state(s);
    s32k3x8_flexcan_update_irq(s);
}

static inline bool s32k3x8_flexcan_is_running(const S32K3X8FlexCANState *s)
{
    uint32_t mcr = s->regs[flexcan_reg_index(FLEXCAN_MCR_OFFSET)];

    return !(mcr & FLEXCAN_MCR_MDIS_MASK) && !(mcr & FLEXCAN_MCR_FRZACK_MASK);
}

static inline bool s32k3x8_flexcan_loopback_enabled(const S32K3X8FlexCANState *s)
{
    return (s->regs[flexcan_reg_index(FLEXCAN_CTRL1_OFFSET)] &
            FLEXCAN_CTRL1_LPB_MASK) != 0U;
}

static inline bool s32k3x8_flexcan_self_reception_enabled(
    const S32K3X8FlexCANState *s)
{
    return (s->regs[flexcan_reg_index(FLEXCAN_MCR_OFFSET)] &
            FLEXCAN_MCR_SRXDIS_MASK) == 0U;
}

static uint32_t s32k3x8_flexcan_mb_mask(const S32K3X8FlexCANState *s,
                                        unsigned mb_idx)
{
    uint32_t mcr = s->regs[flexcan_reg_index(FLEXCAN_MCR_OFFSET)];

    if (mcr & FLEXCAN_MCR_IRMQ_MASK) {
        return s->regs[flexcan_reg_index(FLEXCAN_RXIMR_OFFSET) + mb_idx];
    }
    if (mb_idx == 14) {
        return s->regs[flexcan_reg_index(FLEXCAN_RX14MASK_OFFSET)];
    }
    if (mb_idx == 15) {
        return s->regs[flexcan_reg_index(FLEXCAN_RX15MASK_OFFSET)];
    }

    return s->regs[flexcan_reg_index(FLEXCAN_RXMGMASK_OFFSET)];
}

static bool s32k3x8_flexcan_mb_matches_frame(const S32K3X8FlexCANState *s,
                                             unsigned mb_idx,
                                             const qemu_can_frame *frame)
{
    const uint32_t *mb = flexcan_mb_addr_const(s, mb_idx);
    if (mb == NULL) {
        return false;
    }

