occhiman/S32K3X8-QEMU/qemu/hw/net/can/s32k3x8_flexcan.c
    uint32_t cs = mb[0];
    uint32_t id = mb[1];
    uint32_t mask;
    bool mb_eff;
    bool frame_eff;

    if (flexcan_cs_code(cs) != FLEXCAN_RX_EMPTY) {
        return false;
    }

    mb_eff = (cs & FLEXCAN_CS_IDE_MASK) != 0U;
    frame_eff = (frame->can_id & QEMU_CAN_EFF_FLAG) != 0U;
    if (mb_eff != frame_eff) {
        return false;
    }

    mask = s32k3x8_flexcan_mb_mask(s, mb_idx);
    if (mb_eff) {
        uint32_t mb_id = id & QEMU_CAN_EFF_MASK;
        uint32_t frame_id = frame->can_id & QEMU_CAN_EFF_MASK;
        uint32_t cmp_mask = mask & QEMU_CAN_EFF_MASK;

        return (mb_id & cmp_mask) == (frame_id & cmp_mask);
    } else {
        uint32_t mb_id = (id >> FLEXCAN_STD_ID_SHIFT) & QEMU_CAN_SFF_MASK;
        uint32_t frame_id = frame->can_id & QEMU_CAN_SFF_MASK;
        uint32_t cmp_mask =
            (mask >> FLEXCAN_STD_ID_SHIFT) & QEMU_CAN_SFF_MASK;

        return (mb_id & cmp_mask) == (frame_id & cmp_mask);
    }
}

static void s32k3x8_flexcan_store_rx_frame(S32K3X8FlexCANState *s,
                                           unsigned mb_idx,
                                           const qemu_can_frame *frame)
{
    uint32_t *mb = flexcan_mb_addr(s, mb_idx);

    if (mb == NULL) {
        return;
    }

    s32k3x8_flexcan_encode_rx_words(s, mb, frame,
                                    s32k3x8_flexcan_mb_payload_size(s, mb_idx));

    s->regs[flexcan_reg_index(FLEXCAN_IFLAG1_OFFSET)] |= (1U << mb_idx);
    s32k3x8_flexcan_update_irq(s);
}

static inline bool s32k3x8_flexcan_mb_is_rx_empty(
    const S32K3X8FlexCANState *s,
    unsigned mb_idx)
{
    const uint32_t *mb = flexcan_mb_addr_const(s, mb_idx);

    return (mb != NULL) && (flexcan_cs_code(mb[0]) == FLEXCAN_RX_EMPTY);
}

static inline bool s32k3x8_flexcan_mb_irq_enabled(
    const S32K3X8FlexCANState *s,
    unsigned mb_idx)
{
    return (s->regs[flexcan_reg_index(FLEXCAN_IMASK1_OFFSET)] &
            (1U << mb_idx)) != 0U;
}

/*
 * RX-by-ISR model used when legacy filtering (FIFO path) is disabled:
 * 1) Try strict mailbox ID/mask matching first.
 * 2) If no match, route to first interrupt-enabled RX_EMPTY mailbox.
 * 3) As a final fallback, route to first RX_EMPTY mailbox.
 */
static bool s32k3x8_flexcan_store_rx_by_isr(S32K3X8FlexCANState *s,
                                            const qemu_can_frame *frame)
{
    for (unsigned mb = 0; mb < FLEXCAN_MB_COUNT; mb++) {
        if (s32k3x8_flexcan_mb_matches_frame(s, mb, frame)) {
            s32k3x8_flexcan_store_rx_frame(s, mb, frame);
            return true;
        }
    }

    for (unsigned mb = 0; mb < FLEXCAN_MB_COUNT; mb++) {
        if (!s32k3x8_flexcan_mb_irq_enabled(s, mb)) {
            continue;
        }
        if (!s32k3x8_flexcan_mb_is_rx_empty(s, mb)) {
            continue;
        }

        s32k3x8_flexcan_store_rx_frame(s, mb, frame);
        return true;
    }

    for (unsigned mb = 0; mb < FLEXCAN_MB_COUNT; mb++) {
        if (!s32k3x8_flexcan_mb_is_rx_empty(s, mb)) {
            continue;
        }

        s32k3x8_flexcan_store_rx_frame(s, mb, frame);
        return true;
    }

    return false;
}

static void s32k3x8_flexcan_tx_complete(S32K3X8FlexCANState *s,
                                        unsigned mb_idx,
                                        bool keep_abort_code)
{
    uint32_t *mb = flexcan_mb_addr(s, mb_idx);
    if (mb == NULL) {
        return;
    }

    uint32_t cs = mb[0];
    uint32_t code = keep_abort_code ? FLEXCAN_TX_ABORT : FLEXCAN_TX_INACTIVE;

    cs &= ~(FLEXCAN_CS_CODE_MASK | FLEXCAN_CS_TIMESTAMP_MASK);
    cs |= (code << FLEXCAN_CS_CODE_SHIFT) & FLEXCAN_CS_CODE_MASK;
    cs |= (uint32_t)s->timestamp++ & FLEXCAN_CS_TIMESTAMP_MASK;
    mb[0] = cs;

    s->regs[flexcan_reg_index(FLEXCAN_IFLAG1_OFFSET)] |= (1U << mb_idx);
    s32k3x8_flexcan_update_irq(s);
}

static void s32k3x8_flexcan_try_tx_mb(S32K3X8FlexCANState *s, unsigned mb_idx)
{
    uint32_t *mb = flexcan_mb_addr(s, mb_idx);
    const uint8_t *mb_bytes;
    uint32_t cs;
    uint32_t code;
    qemu_can_frame frame = {0};
    uint8_t payload_cap = s32k3x8_flexcan_mb_payload_size(s, mb_idx);
    uint8_t len;
    bool is_fd;
    uint8_t copy_len;

    if (mb == NULL) {
        return;
    }

    cs = mb[0];
    code = flexcan_cs_code(cs);
    mb_bytes = (const uint8_t *)&mb[2];

    if (!s32k3x8_flexcan_is_running(s)) {
        return;
    }

    if (s32k3x8_flexcan_legacy_fifo_enabled(s)) {
        uint32_t occupied_last = 5U + (s32k3x8_flexcan_legacy_filter_count(s) / 4U);

        if (mb_idx <= occupied_last) {
            return;
        }
    }

    if (code == FLEXCAN_TX_ABORT) {
        s32k3x8_flexcan_tx_complete(s, mb_idx, true);
        return;
    }

    if (code != FLEXCAN_TX_DATA_CODE) {
        return;
    }

    if (cs & FLEXCAN_CS_IDE_MASK) {
        frame.can_id = mb[1] & QEMU_CAN_EFF_MASK;
        frame.can_id |= QEMU_CAN_EFF_FLAG;
    } else {
        frame.can_id = (mb[1] >> FLEXCAN_STD_ID_SHIFT) & QEMU_CAN_SFF_MASK;
    }

    if (cs & FLEXCAN_CS_RTR_MASK) {
        frame.can_id |= QEMU_CAN_RTR_FLAG;
    }

    len = can_dlc2len((cs & FLEXCAN_CS_DLC_MASK) >> FLEXCAN_CS_DLC_SHIFT);
    is_fd = ((cs & FLEXCAN_CS_EDL_MASK) != 0U) || (len > 8U);
    frame.can_dlc = len;
    frame.flags = 0U;
    if (is_fd) {
        frame.flags |= QEMU_CAN_FRMF_TYPE_FD;
        if (cs & FLEXCAN_CS_BRS_MASK) {
            frame.flags |= QEMU_CAN_FRMF_BRS;
        }
        if (cs & FLEXCAN_CS_ESI_MASK) {
            frame.flags |= QEMU_CAN_FRMF_ESI;
        }
    }

    copy_len = MIN(len, payload_cap);
    for (uint8_t i = 0; i < copy_len; i++) {
        frame.data[i] = mb_bytes[flexcan_word_swapped_index(i)];
    }
    for (uint8_t i = copy_len; i < len; i++) {
        frame.data[i] = 0xCC;
    }

    if (s32k3x8_flexcan_loopback_enabled(s) ||
        s32k3x8_flexcan_self_reception_enabled(s)) {
        (void)s32k3x8_flexcan_receive(&s->bus_client, &frame, 1);
    }

    if (!s32k3x8_flexcan_loopback_enabled(s) && s->bus_client.bus) {
        (void)can_bus_client_send(&s->bus_client, &frame, 1);
    }

    s32k3x8_flexcan_tx_complete(s, mb_idx, false);
}

