occhiman/S32K3X8-QEMU/qemu/hw/net/can/s32k3x8_flexcan.c
static uint64_t s32k3x8_flexcan_read(void *opaque, hwaddr addr, unsigned size)
{
    S32K3X8FlexCANState *s = S32K3X8_FLEXCAN(opaque);
    uint32_t idx;

    if ((size != 1U) && (size != 2U) && (size != 4U)) {
        qemu_log_mask(LOG_GUEST_ERROR,
                      "s32k3x8-flexcan: invalid read size %u @0x%" HWADDR_PRIx
                      "\n", size, addr);
        return 0;
    }
    if ((addr + size) > S32K3X8_FLEXCAN_MMIO_SIZE) {
        qemu_log_mask(LOG_GUEST_ERROR,
                      "s32k3x8-flexcan: out-of-range read @0x%" HWADDR_PRIx
                      "\n", addr);
        return 0;
    }

    if (addr == FLEXCAN_TIMER_OFFSET) {
        s->regs[flexcan_reg_index(FLEXCAN_TIMER_OFFSET)] =
            (uint32_t)s->timestamp++;

        if (s32k3x8_flexcan_legacy_fifo_enabled(s) &&
            (s->regs[flexcan_reg_index(FLEXCAN_IFLAG1_OFFSET)] &
             FLEXCAN_IFLAG1_BUF5I_MASK) == 0U) {
            s32k3x8_flexcan_legacy_present_front(s);
            s32k3x8_flexcan_legacy_update_status(s);
            s32k3x8_flexcan_update_irq(s);
        }
    }

    if ((size != 4U) || ((addr & 0x3U) != 0U)) {
        return flexcan_raw_read_le(s, addr, size);
    }

    idx = flexcan_reg_index(addr);
    return s->regs[idx];
}

static void s32k3x8_flexcan_write(void *opaque,
                                  hwaddr addr,
                                  uint64_t value,
                                  unsigned size)
{
    S32K3X8FlexCANState *s = S32K3X8_FLEXCAN(opaque);
    uint32_t v = (uint32_t)value;
    uint32_t idx;
    unsigned mb_idx;

    if ((size != 1U) && (size != 2U) && (size != 4U)) {
        qemu_log_mask(LOG_GUEST_ERROR,
                      "s32k3x8-flexcan: invalid write size %u @0x%" HWADDR_PRIx
                      "\n", size, addr);
        return;
    }
    if ((addr + size) > S32K3X8_FLEXCAN_MMIO_SIZE) {
        qemu_log_mask(LOG_GUEST_ERROR,
                      "s32k3x8-flexcan: out-of-range write @0x%" HWADDR_PRIx
                      "\n", addr);
        return;
    }

    if ((size != 4U) || ((addr & 0x3U) != 0U)) {
        flexcan_raw_write_le(s, addr, v, size);
        return;
    }

    idx = flexcan_reg_index(addr);
    switch (addr) {
    case FLEXCAN_MCR_OFFSET:
    {
        bool old_rfen = s32k3x8_flexcan_legacy_fifo_enabled(s);

        s->regs[idx] &= FLEXCAN_MCR_LPMACK_MASK |
                        FLEXCAN_MCR_FRZACK_MASK |
                        FLEXCAN_MCR_NOTRDY_MASK;
        s->regs[idx] |= v & ~(FLEXCAN_MCR_LPMACK_MASK |
                              FLEXCAN_MCR_FRZACK_MASK |
                              FLEXCAN_MCR_NOTRDY_MASK);
        if (v & FLEXCAN_MCR_SOFTRST_MASK) {
            s32k3x8_flexcan_reset_registers(s);
        } else {
            s32k3x8_flexcan_update_mcr_state(s);

            if (s32k3x8_flexcan_legacy_fifo_enabled(s) != old_rfen) {
                s32k3x8_flexcan_reset_legacy_fifo(s);
            }
            if (s32k3x8_flexcan_legacy_fifo_enabled(s) &&
                s32k3x8_flexcan_enhanced_fifo_enabled(s)) {
                s->regs[flexcan_reg_index(FLEXCAN_ERFCR_OFFSET)] &=
                    ~FLEXCAN_ERFCR_ERFEN_MASK;
                s32k3x8_flexcan_reset_enhanced_fifo(s);
            }
        }
        s32k3x8_flexcan_update_irq(s);
        break;
    }
    case FLEXCAN_IMASK1_OFFSET:
    case FLEXCAN_IMASK2_OFFSET:
    case FLEXCAN_IMASK3_OFFSET:
        s->regs[idx] = v;
        s32k3x8_flexcan_update_irq(s);
        break;
    case FLEXCAN_IFLAG1_OFFSET:
        if (s32k3x8_flexcan_legacy_fifo_enabled(s) &&
            (v & FLEXCAN_IFLAG1_BUF5I_MASK) &&
            (s->regs[idx] & FLEXCAN_IFLAG1_BUF5I_MASK)) {
            s->regs[idx] &= ~(v & ~FLEXCAN_IFLAG1_BUF5I_MASK);
            s32k3x8_flexcan_legacy_pop(s);
        } else {
            s->regs[idx] &= ~v;
            s32k3x8_flexcan_rearm_rx_mb_from_iflag1(s, v);
        }
        if (v & FLEXCAN_IFLAG1_BUF7I_MASK) {
            s->regs[idx] &= ~FLEXCAN_IFLAG1_BUF7I_MASK;
        }
        s32k3x8_flexcan_update_irq(s);
        break;
    case FLEXCAN_IFLAG2_OFFSET:
    case FLEXCAN_IFLAG3_OFFSET:
        /* W1C. */
        s->regs[idx] &= ~v;
        s32k3x8_flexcan_update_irq(s);
        break;
    case FLEXCAN_ERFCR_OFFSET:
    {
        bool old_erfen = s32k3x8_flexcan_enhanced_fifo_enabled(s);

        s->regs[idx] = v;
        if (s32k3x8_flexcan_legacy_fifo_enabled(s)) {
            s->regs[idx] &= ~FLEXCAN_ERFCR_ERFEN_MASK;
        }

        if (s32k3x8_flexcan_enhanced_fifo_enabled(s) != old_erfen) {
            s32k3x8_flexcan_reset_enhanced_fifo(s);
            if (s32k3x8_flexcan_enhanced_fifo_enabled(s)) {
                s32k3x8_flexcan_enhanced_update_status(s);
            }
        } else if (s32k3x8_flexcan_enhanced_fifo_enabled(s)) {
            s32k3x8_flexcan_enhanced_update_status(s);
        }

        s32k3x8_flexcan_update_irq(s);
        break;
    }
    case FLEXCAN_ERFIER_OFFSET:
        s->regs[idx] = v;
        s32k3x8_flexcan_update_irq(s);
        break;
    case FLEXCAN_ERFSR_OFFSET:
        if (v & FLEXCAN_ERFSR_ERFCLR_MASK) {
            s32k3x8_flexcan_reset_enhanced_fifo(s);
            if (s32k3x8_flexcan_enhanced_fifo_enabled(s)) {
                s32k3x8_flexcan_enhanced_update_status(s);
            }
        } else if (v & FLEXCAN_ERFSR_ERFDA_MASK) {
            s->regs[idx] &= ~(v & (FLEXCAN_ERFSR_ERFWMI_MASK |
                                   FLEXCAN_ERFSR_ERFOVF_MASK |
                                   FLEXCAN_ERFSR_ERFUFW_MASK));
            s32k3x8_flexcan_enhanced_pop(s);
        } else {
            s->regs[idx] &= ~(v & (FLEXCAN_ERFSR_ERFWMI_MASK |
                                   FLEXCAN_ERFSR_ERFOVF_MASK |
                                   FLEXCAN_ERFSR_ERFUFW_MASK));
            if (s32k3x8_flexcan_enhanced_fifo_enabled(s)) {
                s32k3x8_flexcan_enhanced_update_status(s);
            }
        }
        s32k3x8_flexcan_update_irq(s);
        break;
    case FLEXCAN_ESR1_OFFSET:
        s->regs[idx] &= ~(v & FLEXCAN_ESR1_W1C_MASK);
        break;
    default:
        s->regs[idx] = v;
        break;
    }

    if ((size == 4U) && flexcan_is_mb_cs_addr(s, addr, &mb_idx)) {
        s32k3x8_flexcan_try_tx_mb(s, mb_idx);
    }
}

static const MemoryRegionOps s32k3x8_flexcan_ops = {
    .read = s32k3x8_flexcan_read,
    .write = s32k3x8_flexcan_write,
    .endianness = DEVICE_LITTLE_ENDIAN,
    .valid = {
        .min_access_size = 1,
        .max_access_size = 4,
        .unaligned = true,
    },
    .impl = {
        .min_access_size = 1,
        .max_access_size = 4,
        .unaligned = true,
    },
};

static bool s32k3x8_flexcan_can_receive(CanBusClientState *client)
{
    S32K3X8FlexCANState *s = container_of(client, S32K3X8FlexCANState,
                                          bus_client);

    return s32k3x8_flexcan_is_running(s);
}

static ssize_t s32k3x8_flexcan_receive(CanBusClientState *client,
                                       const qemu_can_frame *frames,
                                       size_t frames_cnt)
{
    S32K3X8FlexCANState *s = container_of(client, S32K3X8FlexCANState,
                                          bus_client);
    ssize_t accepted = 0;

