occhiman/S32K3X8-QEMU/qemu/hw/net/can/s32k3x8_flexcan.c
    for (size_t fi = 0; fi < frames_cnt; fi++) {
        const qemu_can_frame *frame = &frames[fi];
        bool stored = false;

        if (s32k3x8_flexcan_enhanced_fifo_enabled(s)) {
            stored = s32k3x8_flexcan_enhanced_enqueue(s, frame);
        } else if (s32k3x8_flexcan_legacy_fifo_enabled(s)) {
            stored = s32k3x8_flexcan_legacy_enqueue(s, frame);
        } else {
            stored = s32k3x8_flexcan_store_rx_by_isr(s, frame);
        }

        if (stored) {
            accepted++;
        } else {
            /* Frame dropped when no RX_EMPTY MB matches. */
        }

        s32k3x8_flexcan_update_irq(s);
    }

    return accepted;
}

static CanBusClientInfo s32k3x8_flexcan_bus_client_info = {
    .can_receive = s32k3x8_flexcan_can_receive,
    .receive = s32k3x8_flexcan_receive,
};

static void s32k3x8_flexcan_reset(DeviceState *dev)
{
    S32K3X8FlexCANState *s = S32K3X8_FLEXCAN(dev);

    s32k3x8_flexcan_reset_registers(s);
}

static void s32k3x8_flexcan_realize(DeviceState *dev, Error **errp)
{
    S32K3X8FlexCANState *s = S32K3X8_FLEXCAN(dev);

    s32k3x8_flexcan_reset(dev);

    if (s->canbus) {
        s->bus_client.info = &s32k3x8_flexcan_bus_client_info;
        if (can_bus_insert_client(s->canbus, &s->bus_client) < 0) {
            error_setg(errp, "s32k3x8-flexcan%u: failed to connect canbus",
                       s->instance_id);
            return;
        }
    }
}

static void s32k3x8_flexcan_unrealize(DeviceState *dev)
{
    S32K3X8FlexCANState *s = S32K3X8_FLEXCAN(dev);

    if (s->bus_client.bus) {
        can_bus_remove_client(&s->bus_client);
    }
}

static void s32k3x8_flexcan_init(Object *obj)
{
    S32K3X8FlexCANState *s = S32K3X8_FLEXCAN(obj);
    SysBusDevice *sbd = SYS_BUS_DEVICE(obj);

    memory_region_init_io(&s->mmio, obj, &s32k3x8_flexcan_ops, s,
                          TYPE_S32K3X8_FLEXCAN, S32K3X8_FLEXCAN_MMIO_SIZE);
    sysbus_init_mmio(sbd, &s->mmio);
    sysbus_init_irq(sbd, &s->irq);
}

static Property s32k3x8_flexcan_properties[] = {
    DEFINE_PROP_UINT32("can-instance", S32K3X8FlexCANState, instance_id, 0),
    DEFINE_PROP_LINK("canbus", S32K3X8FlexCANState, canbus, TYPE_CAN_BUS,
                     CanBusState *),
    DEFINE_PROP_END_OF_LIST(),
};

static void s32k3x8_flexcan_class_init(ObjectClass *klass, void *data)
{
    DeviceClass *dc = DEVICE_CLASS(klass);

    dc->realize = s32k3x8_flexcan_realize;
    dc->unrealize = s32k3x8_flexcan_unrealize;
    device_class_set_legacy_reset(dc, s32k3x8_flexcan_reset);
    device_class_set_props(dc, s32k3x8_flexcan_properties);
}

static const TypeInfo s32k3x8_flexcan_info = {
    .name = TYPE_S32K3X8_FLEXCAN,
    .parent = TYPE_SYS_BUS_DEVICE,
    .instance_size = sizeof(S32K3X8FlexCANState),
    .instance_init = s32k3x8_flexcan_init,
    .class_init = s32k3x8_flexcan_class_init,
};

static void s32k3x8_flexcan_register_types(void)
{
    type_register_static(&s32k3x8_flexcan_info);
}

type_init(s32k3x8_flexcan_register_types)
